In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [8]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [9]:
# 1. Some values in the the FlightNumber column are missing. 
#These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. 
#Fill in these missing numbers and make the column an integer column  (instead of a float column). 
df[['FlightNumber']].isnull()

   FlightNumber
0         False
1          True
2         False
3          True
4         False

In [10]:
inval = df['FlightNumber'][0]

In [11]:
inval

10045.0

In [12]:
updated = list()
for i in range(df.shape[0]):
    updated.append(inval)
    inval += 10

In [13]:
df[['FlightNumber']] = updated

In [14]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [15]:
# 2: 
a,b = "abc_efg".split('_')

In [16]:
#The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ 
#to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  
#DataFrame. 
#Method 1
#df[['A', 'B']] = df['AB'].str.split(' ', 1, expand=True)

#Method 2
fr = list()
to = list()
for i in df['From_To']:
    print(type(a))
    a,b = i.split('_')
    a = a.title()
    b = b.title()
    fr.append(a)
    to.append(b)

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [17]:
fr

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [18]:
to

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [19]:
df['From'] = fr
df['To'] = to

In [20]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [21]:
df.drop('From_To',axis=1,inplace=True)

In [22]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [48]:
df = df.iloc[:,[-2,-1,0,1,2]]

In [49]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"